Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/ModificaClienteDesembolsoLineaCredito/wsdl/modificaClienteDesembolsoLineaCreditoPS.wsdl

<wsdl:definitions name="modificaClienteDesembolsoLineaCreditoPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/modificaClienteDesembolsoLineaCreditoPS/" xmlns:tns="http://www.ficohsa.com.hn/middleware.services/modificaClienteDesembolsoLineaCreditoPS/" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:set="http://www.ficohsa.com.hn/middleware.services/serviciosEmpresarialesTypes" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
	
	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/serviciosEmpresarialesTypes" schemaLocation="../../ServiciosEmpresariales/xsd/serviciosEmpresarialesTypes.xsd"/>
		</xsd:schema>
	</wsdl:types>
	
	<wsdl:message name="modificaClienteDesembolsoLineaCredito">
		<wsdl:part element="set:modificaClienteDesembolsoLineaCredito" name="parameters"/>
		<wsdl:part element="auth:RequestHeader" name="RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="modificaClienteDesembolsoLineaCreditoResponse">
		<wsdl:part element="set:modificaClienteDesembolsoLineaCreditoResponse" name="result"/>
		<wsdl:part element="auth:ResponseHeader" name="ResponseHeader"/>
	</wsdl:message>
	
	<wsdl:portType name="modificaClienteDesembolsoLineaCreditoPS">
		<wsdl:operation name="modificaClienteDesembolsoLineaCredito" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="tns:modificaClienteDesembolsoLineaCredito"/>
			<wsdl:output message="tns:modificaClienteDesembolsoLineaCreditoResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="modificaClienteDesembolsoLineaCreditoPSSOAP" type="tns:modificaClienteDesembolsoLineaCreditoPS">
	
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		
		<wsdl:operation name="modificaClienteDesembolsoLineaCredito">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/serviciosEmpresarialesPS/serviciosEmpresariales"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="tns:modificaClienteDesembolsoLineaCredito" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="tns:modificaClienteDesembolsoLineaCreditoResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>	
	</wsdl:binding>

	<wsdl:service name="modificaClienteDesembolsoLineaCreditoPS">
		<wsdl:port binding="tns:modificaClienteDesembolsoLineaCreditoPSSOAP" name="modificaClienteDesembolsoLineaCreditoPS">
	  		<soap:address location="http://172.23.13.19:8003/Middleware/OperationsAndExecution/CustomerLoans/ModificaClienteDLC"/>
	   	</wsdl:port>
	</wsdl:service>
	
</wsdl:definitions>